trade_exp/src/InformationRegisters/ЭлектроннаяОчередьКлиентов/ЭлектроннаяОчередьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d8c9c294-870a-44ea-8c5a-f42a13a7459f">
  <name>ЭлектроннаяОчередьКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="7bf41d18-a27a-4fba-80a3-8f6785279797">
    <name>ЧастичноОтгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b0a91b44-0e01-4076-bc0a-e247692c423d">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e7944fb5-14d5-41da-8470-3a465f450b0b">
    <name>ОтметкаКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="99ad658e-788e-4122-b16a-fcaa62283677">
    <name>ТребуетсяОповещениеКладовщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0e22a688-0adf-48bf-b768-8d362798bfa0">
    <name>ПолучательУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="801d9ec6-cb3c-4867-98c2-4afaa72c9673">
    <name>СтатусОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5dccbe81-f872-46d5-a8a5-30af95c1f5d6">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d26f016a-39dd-4378-824e-bb04999f6b10">
    <name>ССайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5888bede-9c96-4076-b99f-977e4a559fc0">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f75ffc24-34ae-4ec8-92d2-90c5ccaaa229">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="16ef9874-783e-49a8-bbc6-59fbe7b17586">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f3371cf8-1d4f-43fc-a7ad-e3e827a6f002">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ШтрихкодыПоСекциямДокумента/ШтрихкодыПоСекциямДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="29531af2-dba3-42ad-9c7b-151933be8b21">
  <name>ШтрихкодыПоСекциямДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="c3fedc95-0bd1-421a-ad42-ed63e3217997">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fd209668-9498-4546-b274-099b5d89c19b">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1c7dae82-7a35-419b-b8a5-0e1eb74689fc">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="88471c71-e486-452f-9ae2-871decbd42a1">
    <name>ДатаФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="01df1321-4602-41fe-ab9e-f0664ac3ee8e">
    <name>Проверен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ecc0fbe7-2de8-43e0-a093-25a7bb457aa0">
    <name>QRкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="3a52a111-7ca0-4772-889b-7605de702891">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="de290d7b-89b5-474a-804d-6b8a1415bf4d">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыЭлектроннойОчереди/СтатусыЭлектроннойОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="50ebb253-dfc9-40d8-b492-fcbfb669bc01">
  <name>СтатусыЭлектроннойОчереди</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b235c12d-541e-4263-bf1d-e5521ad06455">
    <name>ОжидаетсяОтбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="83736d22-9656-4e5f-97c8-dcdcdec7ef61">
    <name>Набирается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c45f0107-54a2-4b21-ae97-e14dca629ad9">
    <name>Набран</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a5091316-357f-4d00-9ffb-5683c9bac672">
    <name>Выдан</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладДляБухгалтерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеРазрешеноРедактированиеЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подотчетник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b6b1d28-2274-4089-bbe0-1f892b513c41">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31714690-5baf-46f1-b063-d29c311537f8">
    <name>ТорговыйЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6da19460-b28a-45da-95fc-40a81653f323">
    <name>СкрытьКоличествоУчетаВПересчетах</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efdd8d42-ae41-4592-8382-d99891278ded">
    <name>ТипСкладаПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad05e83-cd86-4595-b1cd-604ad5d18c31">
    <name>ДопСкладПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc9d13f0-85a3-4086-9203-6e34b242f14b">
    <name>ОтправкаУведомлений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3d49e10-572c-4e29-a20e-727c92be2a9e">
    <name>ПовторноеУведомление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57e1c5a7-2f3b-451e-b301-5b891fe6cb38">
    <name>ТелефонПодрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="682997ea-3be2-4a30-8770-7535fef1dbdd">
    <name>EMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6500dc86-8583-4657-936f-1ccc78a87015">
    <name>ДопEMAILподрядчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="93e0d2a6-ba2b-4dd6-9aa3-ef4cbd740848">
    <name>УведомлятьВБитриксОПоступлениях</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d5793ec-4952-45ae-ba13-3ea772eca4ae">
    <name>УведомлятьВБитриксОСписанииПодотчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2354dc18-0c64-42c5-8971-6e5307b195f6">
    <name>ИндивидуальныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/HTTPServices/ОбменСЭлектроннойОчередью/Module.bsl
Функция ПолучитьСкладыСекцииGetStores(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("error");
	ЗаписьJSON.ЗаписатьЗначение(Ложь);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("response");
	ЗаписьJSON.ЗаписатьНачалоМассива();    
	
	ПараметрЗапроса = 0;
	Для Каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
		Если Лев(Параметр.Ключ, 10) = "only_shops" Тогда
			ПараметрЗапроса = 1;    
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаПоСкладам = СкладыСекцииОтгрузки(ПараметрЗапроса).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСкладам.Следующий() Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("name");
		ЗаписьJSON.ЗаписатьЗначение(ВыборкаПоСкладам.СкладНаименование);	
		
		ЗаписьJSON.ЗаписатьИмяСвойства("code");
		КодСклада = Строка(ВыборкаПоСкладам.СкладСсылка.УникальныйИдентификатор());
		ЗаписьJSON.ЗаписатьЗначение(КодСклада);	
		
		ЗаписьJSON.ЗаписатьИмяСвойства("section");
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		ВыборкаПоСекциям = ВыборкаПоСкладам.Выбрать();
		Пока ВыборкаПоСекциям.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаПоСекциям.СекцияНаименование) Тогда
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				
				ЗаписьJSON.ЗаписатьИмяСвойства("name");
				ЗаписьJSON.ЗаписатьЗначение(ВыборкаПоСекциям.СекцияНаименование);
				
				ЗаписьJSON.ЗаписатьИмяСвойства("code");
				КодСекции = Строка(ВыборкаПоСекциям.СекцияСсылка.УникальныйИдентификатор());
				ЗаписьJSON.ЗаписатьЗначение(КодСекции);	
				
				ЗаписьJSON.ЗаписатьКонецОбъекта();
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();	
		
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ответ;
КонецФункции

Функция ПолучитьЗаказыGetOrders(Запрос)
	
	ТекстОшибки = "";
	Если Запрос.ПараметрыЗапроса.Количество() < 2 Тогда
		
		Если Запрос.ПараметрыЗапроса.Количество() = 0 Тогда
			ТекстОшибки = "Отсутствуют параметры Склад (store) и Секции (section)"
		Иначе
			ТекстОшибки = "Недостаточно параметров Склад (store) и Секции (section)"
		КонецЕсли;
		
	КонецЕсли;
	
	Склад = Неопределено;
	Секции = Новый Массив;
	
	Если ТекстОшибки = "" Тогда
		Для Каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
			
			Если Параметр.Ключ = "store" Тогда
				Попытка
					Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметр.Значение));			
				Исключение
					ТекстОшибки = "Некорректное значение параметра Склад (store): " + Параметр.Значение;
				КонецПопытки;
			КонецЕсли;
			
			Если Лев(Параметр.Ключ, 7) = "section" Тогда
				Попытка
					Секция = Справочники.РабочиеУчастки.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметр.Значение));			
				Исключение
					ТекстОшибки = "Некорректное значение параметров Секции (section): " + Параметр.Значение;	
				КонецПопытки;
				
				Секции.Добавить(Секция);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если (ТекстОшибки = "") И (Склад = Неопределено) Тогда
		ТекстОшибки = "Отсутствует параметр Склад (store)";
	КонецЕсли;
	
	Если (ТекстОшибки = "") И (Секции.Количество() = 0) Тогда
		ТекстОшибки = "Отсутствует параметры Секции (section)";
	КонецЕсли;
	
	Если ТекстОшибки <> "" Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ПроверятьСтруктуру = Ложь;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("error");
		ЗаписьJSON.ЗаписатьЗначение(Истина);		
		ЗаписьJSON.ЗаписатьИмяСвойства("desctiption");
		ЗаписьJSON.ЗаписатьЗначение(ТекстОшибки);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		СтрокаJSON = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
		
		Возврат Ответ;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("error");
	ЗаписьJSON.ЗаписатьЗначение(Ложь);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("response");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("store");
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("name");
	ЗаписьJSON.ЗаписатьЗначение(Склад.Наименование);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("code");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Склад.УникальныйИдентификатор()));
	
	ЗаписьJSON.ЗаписатьИмяСвойства("section");
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для Каждого Секция Из Секции Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("name");
		ЗаписьJSON.ЗаписатьЗначение(Секция.Наименование);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("code");
		ЗаписьJSON.ЗаписатьЗначение(Строка(Секция.УникальныйИдентификатор()));
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	
	
	ВсеЗаказы = Заказы(Склад, Секции[0]);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("items");	
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	
	Для Счетчик = 0 По 2 Цикл
		
		Выборка = ВсеЗаказы[Счетчик].Выбрать();
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		Если Счетчик = 0 Тогда
			ЗаписьJSON.ЗаписатьИмяСвойства("queue");
		ИначеЕсли Счетчик = 1 Тогда
			ЗаписьJSON.ЗаписатьИмяСвойства("in_pogress");
		ИначеЕсли Счетчик = 2 Тогда
			ЗаписьJSON.ЗаписатьИмяСвойства("ready");
		КонецЕсли;
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		Пока Выборка.Следующий() Цикл
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			ЗаписьJSON.ЗаписатьИмяСвойства("title");
			ЗаписьJSON.ЗаписатьЗначение(Выборка.НомерДокумента);
			
			Статус = 0;
			
			Если Выборка.ССайта = Истина Тогда
				Статус = 2;
			КонецЕсли;
			
			Если Выборка.Срочный = Истина Тогда
				Статус = 1;
			КонецЕсли;
			
			Если Выборка.ЧастичноОтгружен = Истина Тогда
				Статус = 3;
			КонецЕсли;
			
			Если Выборка.ТребуетсяОповещениеКладовщику = Истина Тогда
				Статус = 4;
			КонецЕсли;
			
			ЗаписьJSON.ЗаписатьИмяСвойства("status");
			ЗаписьJSON.ЗаписатьЗначение(Статус);
			
			ЗаписьJSON.ЗаписатьИмяСвойства("keeper");
			
			Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
				Сотрудник = Выборка.Сотрудник;
			Иначе
				Сотрудник = "";
			КонецЕсли; 
			ЗаписьJSON.ЗаписатьЗначение(Сотрудник);
			
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ответ;

КонецФункции

Функция ПолучитьТекущийЗаказGetCurrentOrder(Запрос) 
	
	Ответ = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);
	
	BarCode = Запрос.ПараметрыЗапроса.Получить("barcode");
	Store = Запрос.ПараметрыЗапроса.Получить("store");
	Section = Запрос.ПараметрыЗапроса.Получить("ection");
	
	СсылкаДокумента = Неопределено;
	Склад = Неопределено;
	Секция = Неопределено;
	
	Попытка
		
		Менеджеры = Новый Массив();
		Менеджеры.Добавить(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
		Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЧекККМ.ПустаяСсылка"));
		
		МассивСсылок = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(BarCode, Менеджеры);
		Если МассивСсылок.Количество() > 0 Тогда
			СсылкаДокумента = МассивСсылок[0];	
		Иначе
			ПоискШтрихкодаСтруктура = ПоискШтрихкодаСекции(BarCode);						
			СсылкаДокумента = ПоискШтрихкодаСтруктура.Документ;
		КонецЕсли;
		
		Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Store));
		Секция = Справочники.РабочиеУчастки.ПолучитьСсылку(Новый УникальныйИдентификатор(Section));
		
	Исключение
		
	КонецПопытки;
	
	ТекстОшибки = "";
	Если ТипЗнч(СсылкаДокумента) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(СсылкаДокумента) = Тип("ДокументСсылка.ЧекККМ") Тогда
		//Пропускаем
	Иначе
		ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "","",Символы.ПС) + "Не найден документ или некорректное значение параметра Штрихкода (BarCode): " + BarCode;
	КонецЕсли;
	
	Если ТипЗнч(Склад) <> Тип("СправочникСсылка.Склады") Тогда
		ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "","",Символы.ПС) + "Не найден склад или некорректное значение параметра склада (Store): " + Store;
	КонецЕсли;
	
	Если ТипЗнч(Секция) <> Тип("СправочникСсылка.РабочиеУчастки") Тогда
		ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "","",Символы.ПС) + "Не найдена секция или некорректное значение параметра секции (Section): " + Section;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("error");
	
	Если ТекстОшибки = "" Тогда
		ЗаписьJSON.ЗаписатьЗначение(Ложь);
		//ТелоОтвета = Новый Структура;
		//ТелоОтвета.Вставить("document_id", СсылкаДокумента.Номер);
		//ТелоОтвета.Вставить("message", "Здравствуйте, мы делаем все возможное, чтобы вынести ваш заказ быстрее");
		ЗаписьJSON.ЗаписатьИмяСвойства("data");
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("document_id");
		ЗаписьJSON.ЗаписатьЗначение(СсылкаДокумента.Номер); 
		ЗаписьJSON.ЗаписатьИмяСвойства("message");
		ЗаписьJSON.ЗаписатьЗначение("Здравствуйте, мы делаем все возможное, чтобы вынести ваш заказ быстрее"); 
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		СоздатьОповещениеКладовщикам(СсылкаДокумента, Склад, Секция);
	Иначе
		ЗаписьJSON.ЗаписатьЗначение(Истина);
		ЗаписьJSON.ЗаписатьИмяСвойства("desctiption");
		ЗаписьJSON.ЗаписатьЗначение(ТекстОшибки);
	КонецЕсли; 
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Ответ;
КонецФункции

Процедура СоздатьОповещениеКладовщикам(Документ, Склад, Секция)
	
	Очередь			 = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
	НаборЗаписей = Очередь.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Отбор.Секция.Установить(Секция);
	НаборЗаписей.Отбор.Склад.Установить(Склад);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НоваяЗапись = НаборЗаписей[0];
		НоваяЗапись.ТребуетсяОповещениеКладовщику = Истина; 
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция СкладыСекцииОтгрузки(ПараметрЗапроса = 0)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыКОтгрузке.Склад.Ссылка КАК СкладСсылка, 
	|	ТоварыКОтгрузке.Склад.Наименование КАК СкладНаименование, 
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток.Ссылка КАК СекцияСсылка,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток.Наименование КАК СекцияНаименование
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(,
	|		(ДокументОтгрузки ССЫЛКА Документ.ЧекККМ
	|		ИЛИ ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента)) КАК ТоварыКОтгрузке
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|	ПО ТоварыКОтгрузке.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|		И ТоварыКОтгрузке.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|		И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|   &УсловиеЗапроса
	|УПОРЯДОЧИТЬ ПО 
	|	ТоварыКОтгрузке.Склад.Наименование,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток.Наименование
	|ИТОГИ ПО ТоварыКОтгрузке.Склад.Ссылка";   
	
	Если ПараметрЗапроса = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеЗапроса","ГДЕ ТоварыКОтгрузке.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке"); 
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеЗапроса","ГДЕ ТоварыКОтгрузке.Склад.ТорговыйЗал"); 
	КонецЕсли;
	
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция Заказы(Склад, Секция) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =" 
	|ВЫБРАТЬ
	|		ЭлектроннаяОчередьКлиентов.НомерДокумента КАК НомерДокумента,
	|		ЭлектроннаяОчередьКлиентов.ССайта КАК ССайта,
	|		ЭлектроннаяОчередьКлиентов.Заехал КАК Срочный,
	|		ЭлектроннаяОчередьКлиентов.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|		ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК ПолучательУведомления,
	|		ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику КАК ТребуетсяОповещениеКладовщику, 
	|		ВЫБОР 
	|			КОГДА ЭлектроннаяОчередьКлиентов.ПолучательУведомления ССЫЛКА Справочник.Сотрудники 
	|				Тогда ЭлектроннаяОчередьКлиентов.ПолучательУведомления.Наименование 
	|		Конец Как Сотрудник
	|	ИЗ
	|		РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
	|	ГДЕ
	|		ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.ОжидаетсяОтбор) 
	|		И ЭлектроннаяОчередьКлиентов.Склад = &Склад
	|		И ЭлектроннаяОчередьКлиентов.Секция = &Секция  
	|		И ЭлектроннаяОчередьКлиентов.ОтметкаКассы = Истина
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ЭлектроннаяОчередьКлиентов.НомерДокумента КАК НомерДокумента,
	|		ЭлектроннаяОчередьКлиентов.ССайта КАК ССайта,
	|		ЭлектроннаяОчередьКлиентов.Заехал КАК Срочный,
	|		ЭлектроннаяОчередьКлиентов.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|		ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК ПолучательУведомления,
	|		ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику КАК ТребуетсяОповещениеКладовщику, 
	|		ВЫБОР 
	|			КОГДА ЭлектроннаяОчередьКлиентов.ПолучательУведомления ССЫЛКА Справочник.Сотрудники 
	|				Тогда ЭлектроннаяОчередьКлиентов.ПолучательУведомления.Наименование 
	|		Конец Как Сотрудник
	|	ИЗ
	|		РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
	|	ГДЕ
	|		ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набирается) 
	|		И ЭлектроннаяОчередьКлиентов.Склад = &Склад
	|		И ЭлектроннаяОчередьКлиентов.Секция = &Секция 
	|		И ЭлектроннаяОчередьКлиентов.ОтметкаКассы = Истина
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ЭлектроннаяОчередьКлиентов.НомерДокумента КАК НомерДокумента,
	|		ЭлектроннаяОчередьКлиентов.ССайта КАК ССайта,
	|		ЭлектроннаяОчередьКлиентов.Заехал КАК Срочный,
	|		ЭлектроннаяОчередьКлиентов.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|		ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК ПолучательУведомления,
	|		ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику КАК ТребуетсяОповещениеКладовщику, 
	|		ВЫБОР 
	|			КОГДА ЭлектроннаяОчередьКлиентов.ПолучательУведомления ССЫЛКА Справочник.Сотрудники 
	|				Тогда ЭлектроннаяОчередьКлиентов.ПолучательУведомления.Наименование 
	|		Конец Как Сотрудник
	|	ИЗ
	|		РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
	|	ГДЕ
	|		ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набран)
	|		И ЭлектроннаяОчередьКлиентов.Склад = &Склад
	|		И ЭлектроннаяОчередьКлиентов.Секция = &Секция  
	|		И ЭлектроннаяОчередьКлиентов.ОтметкаКассы = Истина;";
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Секция", Секция);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	Возврат  ПакетЗапросов;  
	
КонецФункции

Функция ПоискШтрихкодаСекции(BarCode)
	
	СтруктураВозврата = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыПоСекциямДокумента.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
	|ГДЕ
	|	ШтрихкодыПоСекциямДокумента.Штрихкод = &Штрихкод";
	
	
	Запрос.УстановитьПараметр("Штрихкод", BarCode);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.Вставить("Документ", Выборка.Документ);
	Иначе
		СтруктураВозврата.Вставить("Документ", Неопределено);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьЗаказыПоСкладуGetOrdersGlobal(Запрос)
	
	Перем Склад, ТекстОшибки;
	Секции = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПараметрыЗапроса = ОплатаСервиса.ДанныеJSON(Запрос.ПолучитьТелоКакСтроку());
		Если ТипЗнч(ПараметрыЗапроса) = Тип("Структура") Тогда
			Если ПараметрыЗапроса.Свойство("store") Тогда 
				Если ЗначениеЗаполнено(ПараметрыЗапроса.store) Тогда
					Попытка
						Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыЗапроса.store));
					Исключение
						ТекстОшибки = "Некорректное значение параметра Склад (store): " + ПараметрыЗапроса.store;
					КонецПопытки;
				Иначе
					ТекстОшибки = "Для параметра Склад (store) передано пустое значение..";	
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТекстОшибки) И 
				ПараметрыЗапроса.Свойство("section") И 
				ТипЗнч(ПараметрыЗапроса.section) = Тип("Массив") И 
				ЗначениеЗаполнено(ПараметрыЗапроса.section) Тогда
				
				Для Каждого Элемент Из ПараметрыЗапроса.section Цикл
					Попытка
						Секция = Справочники.РабочиеУчастки.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент));
						Если ЗначениеЗаполнено(Секция) Тогда
							Секции.Добавить(Секция);            
						КонецЕсли;
					Исключение
						ТекстОшибки = "Некорректное значение параметра Секции (section): " + Элемент;
						Прервать;
					КонецПопытки;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТекстОшибки = "Не удалось получить тело Get запроса..";
	КонецПопытки;
		
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ПроверятьСтруктуру = Ложь;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("error");
		ЗаписьJSON.ЗаписатьЗначение(Истина);		
		ЗаписьJSON.ЗаписатьИмяСвойства("desctiption");
		ЗаписьJSON.ЗаписатьЗначение(ТекстОшибки);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		СтрокаJSON = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
		
		Возврат Ответ;
	КонецЕсли;

	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); // --
	
	ЗаписьJSON.ЗаписатьИмяСвойства("error");
	ЗаписьJSON.ЗаписатьЗначение(Ложь);
	
	ЗаписьJSON.ЗаписатьИмяСвойства("response");
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); // response 
	
	ЗаписьJSON.ЗаписатьИмяСвойства("store");
	ЗаписьJSON.ЗаписатьНачалоОбъекта(); // store
	
	ЗаписьJSON.ЗаписатьИмяСвойства("id");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Склад.УникальныйИдентификатор()));
	
	ЗаписьJSON.ЗаписатьИмяСвойства("name");
	ЗаписьJSON.ЗаписатьЗначение(Склад.Наименование);
	ЗаписьJSON.ЗаписатьКонецОбъекта(); //store 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеУчастки.Владелец КАК Склад,
		|	РабочиеУчастки.Ссылка КАК Секция,
		|	РабочиеУчастки.Ссылка.Наименование КАК СекцияНаименование
		|ПОМЕСТИТЬ ВТИтог
		|ИЗ
		|	Справочник.РабочиеУчастки КАК РабочиеУчастки
		|ГДЕ
		|	НЕ РабочиеУчастки.ПометкаУдаления
		|	И РабочиеУчастки.Владелец = &Склад
		|	И &УсловиеПоСекциям
		|	И РабочиеУчастки.ЭлектроннаяОчередь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Секция КАК Секция,
		|	Итог.СекцияНаименование КАК СекцияНаименование
		|ИЗ
		|	ВТИтог КАК Итог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Секция КАК Секция,
		|	Итог.СекцияНаименование КАК СекцияНаименование,
		|	ЭлектроннаяОчередьКлиентов.НомерДокумента КАК НомерДокумента,
		|	ВЫБОР
		|		КОГДА ЭлектроннаяОчередьКлиентов.ПолучательУведомления ССЫЛКА Справочник.Сотрудники
		|			ТОГДА ЭлектроннаяОчередьКлиентов.ПолучательУведомления.Наименование
		|	КОНЕЦ КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.ОжидаетсяОтбор)
		|			ТОГДА ""queue""
		|		КОГДА ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набирается)
		|			ТОГДА ""in_pogress""
		|		КОГДА ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набран)
		|			ТОГДА ""ready""
		|	КОНЕЦ КАК Состояние,
		|	ВЫБОР
		|		КОГДА ЭлектроннаяОчередьКлиентов.Заехал
		|			ТОГДА 1
		|		КОГДА ЭлектроннаяОчередьКлиентов.ССайта
		|			ТОГДА 2
		|		КОГДА ЭлектроннаяОчередьКлиентов.ЧастичноОтгружен
		|			ТОГДА 3
		|		КОГДА ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику
		|			ТОГДА 4
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Статус
		|ИЗ
		|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИтог КАК Итог
		|		ПО ЭлектроннаяОчередьКлиентов.Склад = Итог.Склад
		|			И ЭлектроннаяОчередьКлиентов.Секция = Итог.Секция
		|ГДЕ
		|	(ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.ОжидаетсяОтбор)
		|			ИЛИ ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набирается)
		|			ИЛИ ЭлектроннаяОчередьКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набран))
		|	И ЭлектроннаяОчередьКлиентов.ОтметкаКассы = ИСТИНА
		|ИТОГИ ПО
		|	НомерДокумента";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Если ЗначениеЗаполнено(Секции) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСекциям", "РабочиеУчастки.Ссылка В(&Секции)");	
		Запрос.УстановитьПараметр("Секции", Секции);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСекциям", "ИСТИНА");
	КонецЕсли;
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("sections");	
	ЗаписьJSON.ЗаписатьНачалоМассива(); // sections
	
	Выборка = МассивРезультатов[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("code");
		ЗаписьJSON.ЗаписатьЗначение(Строка(Выборка.Секция.УникальныйИдентификатор()));
		
		ЗаписьJSON.ЗаписатьИмяСвойства("name");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.СекцияНаименование);
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;   
	
	ЗаписьJSON.ЗаписатьКонецМассива(); // sections
	
	ЗаписьJSON.ЗаписатьИмяСвойства("orders");	
	ЗаписьJSON.ЗаписатьНачалоМассива(); // orders   
		
	Выборка = МассивРезультатов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("title");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.НомерДокумента); 
		
		ЗаписьJSON.ЗаписатьИмяСвойства("sections");	
		ЗаписьJSON.ЗаписатьНачалоМассива(); // sections
		
		ВыборкаДетальная = Выборка.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			ЗаписьJSON.ЗаписатьИмяСвойства("code");
			ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальная.Секция.УникальныйИдентификатор()));
			
			ЗаписьJSON.ЗаписатьИмяСвойства("name");
			ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальная.СекцияНаименование);
			
			ЗаписьJSON.ЗаписатьИмяСвойства("order");
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			ЗаписьJSON.ЗаписатьИмяСвойства("title");
			ЗаписьJSON.ЗаписатьЗначение(Выборка.НомерДокумента);
			
			ЗаписьJSON.ЗаписатьИмяСвойства("status");
			ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальная.Статус);
			
			ЗаписьJSON.ЗаписатьИмяСвойства("keeper"); 
			ЗаписьJSON.ЗаписатьЗначение(?(ЗначениеЗаполнено(ВыборкаДетальная.Сотрудник), ВыборкаДетальная.Сотрудник, ""));
			
			ЗаписьJSON.ЗаписатьИмяСвойства("progress");
			ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальная.Состояние);
				
			ЗаписьJSON.ЗаписатьКонецОбъекта();
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива(); // sections
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива(); // orders
	
	ЗаписьJSON.ЗаписатьКонецОбъекта(); // response
	ЗаписьJSON.ЗаписатьКонецОбъекта(); //--  
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции
